app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
          @artist = Artist.find_by_id(params[:artist_id])
         if ! @artist
          redirect_to artists_path , alert: "Artist not found"
        else
          @songs=@artist.songs
        end
    else
      @songs =Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ?  ORDER BY "artists"."id" ASC LIMIT 1  [["id", 0]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]

  def show
    if params[:artist_id]
      @artist= Artist.find(params[:artist_id])
      @song=@artist.songs.find_by_id(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ?  ORDER BY "artists"."id" ASC LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ?  ORDER BY "songs"."id" ASC LIMIT 1  [["artist_id", 5], ["id", 12345]]